----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1       [-1, 64, 1056, 1056]           1,216
              ReLU-2       [-1, 64, 1056, 1056]               0
            Conv2d-3       [-1, 64, 1056, 1056]          36,928
              ReLU-4       [-1, 64, 1056, 1056]               0
         MaxPool2d-5         [-1, 64, 528, 528]               0
            Conv2d-6        [-1, 128, 528, 528]          73,856
              ReLU-7        [-1, 128, 528, 528]               0
            Conv2d-8        [-1, 128, 528, 528]         147,584
              ReLU-9        [-1, 128, 528, 528]               0
        MaxPool2d-10        [-1, 128, 264, 264]               0
           Conv2d-11        [-1, 256, 264, 264]         295,168
             ReLU-12        [-1, 256, 264, 264]               0
           Conv2d-13        [-1, 256, 264, 264]         590,080
             ReLU-14        [-1, 256, 264, 264]               0
        MaxPool2d-15        [-1, 256, 132, 132]               0
           Conv2d-16        [-1, 512, 132, 132]       1,180,160
             ReLU-17        [-1, 512, 132, 132]               0
           Conv2d-18        [-1, 512, 132, 132]       2,359,808
             ReLU-19        [-1, 512, 132, 132]               0
         Upsample-20        [-1, 512, 264, 264]               0
           Conv2d-21        [-1, 256, 264, 264]       1,769,728
             ReLU-22        [-1, 256, 264, 264]               0
           Conv2d-23        [-1, 256, 264, 264]         590,080
             ReLU-24        [-1, 256, 264, 264]               0
         Upsample-25        [-1, 256, 528, 528]               0
           Conv2d-26        [-1, 128, 528, 528]         442,496
             ReLU-27        [-1, 128, 528, 528]               0
           Conv2d-28        [-1, 128, 528, 528]         147,584
             ReLU-29        [-1, 128, 528, 528]               0
         Upsample-30      [-1, 128, 1056, 1056]               0
           Conv2d-31       [-1, 64, 1056, 1056]         110,656
             ReLU-32       [-1, 64, 1056, 1056]               0
           Conv2d-33       [-1, 64, 1056, 1056]          36,928
             ReLU-34       [-1, 64, 1056, 1056]               0
           Conv2d-35        [-1, 1, 1056, 1056]              65
================================================================
Total params: 7,782,337
Trainable params: 7,782,337
Non-trainable params: 0
----------------------------------------------------------------